src/cf/AccumulationRegisters/РасчетыСПрочимиКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСПрочимиКонтрагентами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СодержаниеПроводки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Comment>АПК:1208</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыплатыСамозанятым</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/РасчетыСПрочимиКонтрагентами/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает сумму задолженности по реестру выплат самозанятым
//
// Параметры:
//		ДокументОплаты - ДокументСсылка - документ оплаты, например, СписаниеСРасчетногоСчета
//		РеестрВыплатыСамозанятым - ДокументСсылка.ВыплатыСамозанятым - реестр, задолженность по которому нужно получить.
// Возвращаемое значение:
//		Число - Сумма задолженности по реестру
//
Функция СуммаЗадолженностиПоРеестру(ДокументОплаты, РеестрВыплатыСамозанятым) Экспорт
	
	Если Не ЗначениеЗаполнено(РеестрВыплатыСамозанятым) Тогда
		Возврат 0;
	КонецЕсли;
	
	// Первый запросом объединения получаем остатки, в которых может быть уже учтена оплата от СписанияСРасчетногоСчета.
	// Вторым запросом объединения восстанавливаем сумму оплата, чтобы она не учитывалась при расчете задолженности.
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОплаты", ДокументОплаты);
	Запрос.УстановитьПараметр("Документ", РеестрВыплатыСамозанятым);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	-РасчетыСПрочимиКонтрагентамиОстатки.СуммаВалОстаток КАК СуммаОстаток
	|ПОМЕСТИТЬ ЗадолженностьСамозанятых
	|ИЗ
	|	РегистрНакопления.РасчетыСПрочимиКонтрагентами.Остатки(, Документ = &Документ) КАК РасчетыСПрочимиКонтрагентамиОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасчетыСПрочимиКонтрагентами.СуммаВал
	|ИЗ
	|	РегистрНакопления.РасчетыСПрочимиКонтрагентами КАК РасчетыСПрочимиКонтрагентами
	|ГДЕ
	|	РасчетыСПрочимиКонтрагентами.Активность
	|	И РасчетыСПрочимиКонтрагентами.Регистратор = &ДокументОплаты
	|	И РасчетыСПрочимиКонтрагентами.Документ = &Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ЗадолженностьСамозанятых.СуммаОстаток) КАК СуммаОстаток
	|ИЗ
	|	ЗадолженностьСамозанятых КАК ЗадолженностьСамозанятых";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СуммаДокумента = Выборка.СуммаОстаток;
	Иначе
		СуммаДокумента = 0;
	КонецЕсли;
	
	Возврат СуммаДокумента;
	
КонецФункции

// Возвращает сумму задолженности по самозанятому в реестре выплат самозанятым
//
// Параметры:
//		ДокументОплаты - ДокументСсылка - документ оплаты, например, СписаниеСРасчетногоСчета
//		РеестрВыплатыСамозанятым - ДокументСсылка.ВыплатыСамозанятым - реестр, в котором была начислена задолженность
//		по самозанятому.
//		Контрагент - СправочникСсылка.Контрагенты - Самозанятый, по которому следует получить задолженность
// Возвращаемое значение:
//		Число - Сумма задолженности по реестру
//
Функция СуммаЗадолженностиПоСамозанятому(ДокументОплаты, РеестрВыплатыСамозанятым, Контрагент) Экспорт
	
	Если Не ЗначениеЗаполнено(РеестрВыплатыСамозанятым) Или Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОплаты", ДокументОплаты);
	Запрос.УстановитьПараметр("Документ", РеестрВыплатыСамозанятым);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	-РасчетыСПрочимиКонтрагентамиОстатки.СуммаВалОстаток КАК СуммаОстаток
	|ПОМЕСТИТЬ ЗадолженностьСамозанятого
	|ИЗ
	|	РегистрНакопления.РасчетыСПрочимиКонтрагентами.Остатки(
	|			,
	|			Контрагент = &Контрагент
	|				И Документ = &Документ) КАК РасчетыСПрочимиКонтрагентамиОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасчетыСПрочимиКонтрагентами.СуммаВал
	|ИЗ
	|	РегистрНакопления.РасчетыСПрочимиКонтрагентами КАК РасчетыСПрочимиКонтрагентами
	|ГДЕ
	|	РасчетыСПрочимиКонтрагентами.Активность
	|	И РасчетыСПрочимиКонтрагентами.Документ = &Документ
	|	И РасчетыСПрочимиКонтрагентами.Контрагент = &Контрагент
	|	И РасчетыСПрочимиКонтрагентами.Регистратор = &ДокументОплаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ЗадолженностьСамозанятого.СуммаОстаток) КАК СуммаОстаток
	|ИЗ
	|	ЗадолженностьСамозанятого КАК ЗадолженностьСамозанятого";
	
	Выборка = Запрос.Выполнить().Выбрать();
	СуммаДокумента = 0;
	Если Выборка.Следующий() Тогда
		СуммаДокумента = Выборка.СуммаОстаток;
	КонецЕсли;
	
	Возврат СуммаДокумента;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Контрагент)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли
